[
  {
    "title": "Career Development for Millennials: the NowEnterprise for the Next Generation",
    "link": "http://blog.tahoepartners.com/index.php/career-development-millennials-nowenterprise-next-generation/",
    "pubDate": "Wed, 02 Apr 2014 21:02:40 +0000",
    "creator": "Mike Davidson",
    "jobTitle": "Creative Director",
    "webAddress": "www.digitalbymike.com",
    "blurb": "Definitely digital. Mike’s experience in digital spans two decades. including marketing, enterprise systems, advertising, retail, mobile, and websites of all kinds. He leads teams of creatives, technologists and useer experience designers to deliver the new customer experience.",
    "creatorImage": "images/blog/mikeD.jpg",
    "imageLocation": "images/blog/blog-1-lg.jpg",
    "content": "<p>What are Millennials looking for in their careers? <a href=\"http://www.linkedin.com/today/post/article/20140122180239-27058877-what-millennials-want-and-why-employers-should-take-notice?trk=eml-ced-b-art-M-1&amp;ut=0l_4EaGtXqJ641\" target=\"_blank\">Research shows</a> they want to work for organizations that value innovation and foster creativity – where imagination and outside-the-box thinking are rewarded. Although they are actively seeking opportunities for career development, above all, they want the option to chart their own course. Over the next 10 years, <a href=\"http://www.forbes.com/sites/danschawbel/2013/09/04/why-you-cant-ignore-millennials/\" target=\"_blank\">Millennials will come to make up more than three quarters of the workforce</a>, yet many companies are not meeting this fundamental need &#8211; 75% of Millennials believe their organizations could do more to develop future leaders.</p> <p>Let me introduce you to Claire. A true Millennial, she doesn’t hesitate to change jobs in pursuit of advancement in her Supply Chain career. Now that she’s a Logistics Manager at an organization that shares her values, she’d like to stay put – here’s how the NowEnterprise helps her do that.</p> <p>With the NowEnterprise, Claire takes an active role in her career development, all managed through her personal career profile. Each day, she reviews her feeds on her Careers Dashboard – think Twitter and Flipboard for the Enterprise. She follows several senior people within her company with skills similar to her own, as well as several external industry experts, incorporated into the NowEnterprise through blog posts and social media. In addition, she belongs to several career-related Groups, both internal and external, integrated into her Careers Dashboard through her LinkedIn profile.</p> <p>As she peruses her feed, Claire sees a new event hosted by the Council of Supply Chain Management Professionals &#8211; a webinar on sustainability practices, a hot topic for Supply Chain professionals. She adds it to her Career Calendar, a self-managed training program that seamlessly combines a company-provided training plan with online classes, conferences, and other opportunities for continuing education. Taking note of this emerging topic, she creates a new category on her virtual pinboard for sustainability. As she starts to gather related content, she can collect it all here – blog posts, articles by industry experts, internal documents, and more.</p> <p>Later that day, someone else in the company posts a request for knowledge on sustainability. Quickly referring to her pinboard, she responds to the request with an article she found earlier that day. Observing that there is interest beyond her own team, she authors a POV on the subject, and posts it to her company’s corporate news under Emerging Trends. By the end of the day, the individual who posted the initial request for information has begun following her, as well as many other colleagues who read her article.</p> <p>As she curates relevant content and fosters these valuable connections, Claire is able to take all of this along with her as she moves upwards through the organization. Leveraging the NowEnterprise to manage her career development, she is able to identify and advance her skills, all the while making herself more visible within the company.</p> <p>As for Claire’s employer, they have realized improvements in the long-term performance of their workforce and in their ability to retain their top talent. Giving their employees the opportunity to direct their own career development – in a way that is highly visible and familiar to use – has been a win-win. The bottom line? They can better identify and reward top performers and internal experts. Engaged employees who feel that they are on a path to the next step in their career tend to do better work – and to stick around.</p> <p>The post <a href=\"http://blog.tahoepartners.com/index.php/career-development-millennials-nowenterprise-next-generation/\">Career Development for Millennials: the NowEnterprise for the Next Generation</a> appeared first on <a href=\"http://blog.tahoepartners.com\">TahoeSmart</a>.</p>"
  },
  {
    "title": "The Future of the Knowledge Worker is the NowEnterprise",
    "link": "http://blog.tahoepartners.com/index.php/future-knowledge-worker-nowenterprise/",
    "pubDate": "Mon, 17 Mar 2014 21:15:43 +0000",
    "creator": "David Sidwell",
    "jobTitle": "Maganing Director",
    "blurb": "An expert in SharePoint and Enterprise Collaboration strategy, Dave has delivered SharePoint business solutions ranging from dynamic websites to a program to capture and track employee ideas. Dave may have backed off his claim to run with anyone at any pace, but he is still a regular distance and event runner.",
    "creatorImage": "images/blog/daveSidwell.jpg",
    "imageLocation": "http://blog.tahoepartners.com/wp-content/uploads/2014/03/Hands-with-Digial-Tablet-Stylus.jpg",
    "content": "<p>In our ongoing series on the new enterprise experience of the <a title=\"Goodbye Intranet. Say Hello to the NowEnterprise.\" href=\"http://blog.tahoepartners.com/index.php/intranets-say-hello-nowenterprise/\" target=\"_blank\"><span style=\"text-decoration: underline;\">NowEnterprise</span></a>, we have examined how the NowEnterprise impacts specific roles, such as <a title=\"Project Management: On-time and On-budget with the NowEnterprise\" href=\"http://blog.tahoepartners.com/index.php/project-management-on-time-and-on-budget-with-the-nowenterprise/\" target=\"_blank\">project manager</a>, and functions, like <a title=\"Collaborative Selling with the NowEnterprise: A Future Focused on Your Customers\" href=\"http://blog.tahoepartners.com/index.php/collaborative-selling-nowenterprise-future-focused-customers/\" target=\"_blank\">collaborative selling</a>. But what does this future state NowEnterprise look like for the typical information worker?</p> <p>According to <a href=\"http://www.mckinsey.com/insights/organization/boosting_the_productivity_of_knowledge_workers\">McKinsey research</a>, knowledge workers spend more than half their workday on “interactions” – with customers, vendors, and other employees. These efforts are indispensable but sometimes difficult to measure. Unlike an assembly line, where efficiency is counted in speed and output, an information worker’s daily tasks tend to be more varied. Improved productivity is found incrementally, and sometimes found outside the office.</p> <p>That is where the NowEnterprise stands out. It can revolutionize the day-to-day efforts of a knowledge worker, by making the most of their time and untethering them from their desks. For example:</p> <p><em><strong>Status Quo</strong></em><br /> <em> I arrive at work in the morning and spend first 45 minutes of the day sorting through emails.</em></p> <p><em><strong>With the NowEnterprise</strong></em><br /> <em> I arrive at work in the morning and log in to the NowEnterprise. I find a list of critical tasks – culled from open requests, calendar items, and the occasional email – and start tackling them in order of priority.</em></p> <p><em><strong>Status Quo</strong></em><br /> <em> I use multiple tools to get my job done, but everything is separate. I spend a lot of unproductive time switching between applications and trying to find information.</em></p> <p><em><strong>With the NowEnterprise</strong></em><br /> <em> All the tools and information I need are available right in the NowEnterprise. I can see my calendar, important tasks, social interactions, and complete my time sheet without jumping between applications.</em></p> <p><em><strong>Status Quo</strong></em><br /> <em> Most interactions are conducted through email – and sometimes things get lost in the shuffle.</em></p> <p><em><strong>With the NowEnterprise</strong></em><br /> <em> Requests from customers and colleagues and items requiring my approval are seamlessly integrated into my “home base” – the NowEnterprise.</em></p> <p><em><strong>Status Quo</strong></em><br /> <em> My kids have an afternoon dentist appointment. I take the afternoon off to pick them up from school and drive them, and kill time reading a People magazine in the waiting room.</em></p> <p><em><strong>With the NowEnterprise</strong></em><br /> <em> With the NowEnterprise, I can work from anywhere. While the kids get their teeth cleaned, I am able to log on with my tablet and pick up right where I left off at my desk.</em></p> <p>The NowEnterprise offers unprecedented flexibility for information workers, while driving major improvements in individual efficiency – and that’s good for both employees and employers. When workers are empowered to do their job effectively, not only are they able to excel, but they are more likely to stick around. Organizations at the forefront of the NowEnterprise will likely find themselves with a more productive, highly satisfied workforce.</p> <p>The post <a href=\"http://blog.tahoepartners.com/index.php/future-knowledge-worker-nowenterprise/\">The Future of the Knowledge Worker is the NowEnterprise</a> appeared first on <a href=\"http://blog.tahoepartners.com\">TahoeSmart</a>.</p>"
  },
  {
    "title": "Goodbye Intranet. Say Hello to the NowEnterprise",
    "link": "http://blog.tahoepartners.com/index.php/intranets-say-hello-nowenterprise/",
    "pubDate": "Mon, 13 Jan 2014 21:17:36 +0000",
    "creator": "Ralph Keipert",
    "jobTitle": "President",
    "blurb": "One of our intrepid co-founders, Ralph is our resident expert in growing and leading consulting firms, helping global and mid-market clients develop actionable, high ROI strategies and implement high impact enterprise digital solutions. He might spend his days driving Tahoe’s SEO and social strategy, but evenings and weekends, he's usually driving his kids to soccer.",
    "creatorImage": "images/blog/ralphKeipert.jpg",
    "imageLocation": "http://blog.tahoepartners.com/wp-content/uploads/2014/01/Coffee-Cup.jpg",
    "content": "<p>Visiting most corporate intranets could be likened to a trip to Dunkin Donuts. You get what you came for – great coffee and maybe a donut or bagel – and you leave. It gets the job done, but there is no reason to stay. Contrast that to Starbucks. You still get a great cup of coffee and a nice scone. But they also provide free wi-fi, comfortable chairs and tables, and a pleasant atmosphere. You feel more inclined to grab a seat, stay a while, and do a little work. Cross a few things off your to-do list. All of a sudden, it starts to become part of your new routine. It becomes part of a new expectation….</p> <p>So what does this have to do with Intranets? When we work with our clients to conduct an Intranet redesign, one of the first things we always do is conduct a survey. Question #1 is always the same: “What reasons do you visit your corporate intranet?”</p> <p>The top answer? The corporate phone directory and org chart. There’s your coffee.</p> <p>The second most popular answer? HR Forms. There’s your donut.</p> <p>Then they leave.</p> <p>There is also an even bigger problem with this scenario. Often, that information is out of date. So this is even worse than the Dunkin Donuts comparison. Your coffee is now served cold. Your donut is stale. Eventually, you go somewhere else.</p> <p>So how do you go about fixing these fundamental issues? It goes without saying that information must be updated. That is a given. But how do you create something that makes them not only want to come back, but also stay and do more?</p> <p>To be fair, when many intranets launched, their capabilities were limited by the lack of some key technologies. That has changed dramatically. As a result, delivering a new version of your intranet that builds on what’s already in place is usually the absolute wrong thing to do. Adding new features to an under-adopted solution isn’t going to get it done. It’s time for an overhaul.</p> <p>Now those key technologies not only exist, but also are quite powerful. The mobile revolution has put smart phones and tablets in the hands of everyone in your workforce. This dramatically increases the ability to access information from anywhere at any time. Best practices for design have changed as a result. Swipe and tap is the new point and click and, yes, good design still needs to translate seamlessly to a PC. The advance of technologies like HTML5 and JS along with the proliferation of device-based apps has elevated user expectations for a much richer and more interactive digital experience. Finally, social technologies have radically changed how people engage with each other, collaborate, and keep up with information. Social is becoming embedded in our work.</p> <p>Let’s get back to our survey. Further down that list of questions, we ask…”what do you want from your intranet?” We generally find the responses are not only quite broad, but also differ by demographic. We find that the younger the workforce, the greater the expectations.  They expect it in their personal lives and they bring that same expectation to the workplace.</p> <p>So what is this New Expectation? It is an expectation to develop a relationship that is much deeper than just information. How do I connect and build relationships with the people around me? How do I connect with the culture? How do I foster my career? Oh, and I want to have fun doing it…</p> <p>From here, we begin to create user personas. As we develop these, we see a very interesting thing happen. Universally, there are three mindsets that we consistently find when conducting the personas.</p> <ul> <li>I want to be highly productive person on a day-to-day basis. I need tools at my fingertips.</li> <li>I have a career path that I am working on. I need information to foster that.</li> <li>I want to enjoy my experience at work. I want this to be more than just a job to me.</li> </ul> <p>So how can we build an enterprise experience that satisfies these mindsets? How do we build the NowEnterprise?</p> <p>Stay tuned as we further elaborate on the NowEnterprise in the coming weeks. It will be a journey you won’t want to miss.</p> <p>The post <a href=\"http://blog.tahoepartners.com/index.php/intranets-say-hello-nowenterprise/\">Goodbye Intranet. Say Hello to the NowEnterprise.</a> appeared first on <a href=\"http://blog.tahoepartners.com\">TahoeSmart</a>.</p>"
  },
  {
    "title": "Enterprise Collaboration Obstacles: Breaking Down Organizational Silos",
    "link": "http://blog.tahoepartners.com/index.php/enterprise-collaboration-obstacles-breaking-down-organizational-silos/",
    "pubDate": "Wed, 26 Jun 2013 20:08:19 +0000",
    "creator": "Ralph Keipert",
    "jobTitle": "President",
    "blurb": "One of our intrepid co-founders, Ralph is our resident expert in growing and leading consulting firms, helping global and mid-market clients develop actionable, high ROI strategies and implement high impact enterprise digital solutions. He might spend his days driving Tahoe’s SEO and social strategy, but evenings and weekends, he's usually driving his kids to soccer.",
    "creatorImage": "images/blog/ralphKeipert.jpg",
    "imageLocation": "http://blog.tahoepartners.com/wp-content/uploads/2013/09/Silos.jpg",
    "content": "<p>We’ve talked before about <a title=\"Enterprise Collaboration Obstacles: Two Reasons for Poor Adoption\" href=\"http://blog.tahoepartners.com/index.php/enterprise-collaboration-obstacles-two-reasons-for-poor-adoption/\" target=\"_blank\">low adoption as a killer of effective collaboration</a>, but organizational silos can be a huge obstacle as well. We have seen cases where collaboration tools are used with reasonable effectiveness within departments, but the broader enterprise benefits go unrealized. Why is this?</p> <p><strong>The problem with departmental adoption only. </strong><br /> Content and knowledge are generally not <em>only</em> useful and relevant to one specific department. It may not be valuable to everyone within an organization, but it’s rarely of importance to just one group. Further, many business processes have stakeholders or contributors across departments. Intentionally or not, limiting access to knowledge and content and transparency to enterprise business processes will reinforce departmental silos and impede collaboration at an enterprise level. What&#8217;s worse, departments often pick their own tools and platforms. If product development is using Yammer and your sales force is using Chatter, you can be assured that there’s not much electronic collaboration happening &#8211; not to mention the agony of watching your ongoing maintenance and support costs going through the roof.</p> <p>A recent McKinsey study, “<a title=\"The rise of the networked enterprise: Web 2.0 finds its payday\" href=\"http://www.mckinsey.com/insights/high_tech_telecoms_internet/the_rise_of_the_networked_enterprise_web_20_finds_its_payday\" target=\"_blank\">The rise of the networked enterprise: Web 2.0 finds its payday</a>” concluded that “companies using the Web intensively gain greater market share and higher margins.” What executive wouldn’t get excited about that? Further, McKinsey states, “A new class of company is emerging &#8211; one that uses collaborative Web 2.0 technologies intensively to connect the internal efforts of employees and to extend the organization’s reach to customers, partners, and suppliers. We call this new kind of company the networked enterprise.”</p> <p>The networked enterprise requires an enterprise view of content, processes and use of collaboration tools.</p> <p><strong>Collaboration with the enterprise in mind.</strong><br /> <strong><em>Content</em></strong>. Two things that spring to the surface in a discussion of content are taxonomy and permissions. Once content is created and stored, the simple adage applies that information is only useful if it can be easily found. This is why search has become such a powerful tool. Free form text search has replaced almost every other historical method of retrieving electronic content. We have Google to thank for that. If you expect your internal customers to find information that will make them more productive at work in ways that are not clearly and accurately defined (taxonomy), it won’t be easy, and they’ll continue to use whatever less effective method they apply today. Of course, who can view and modify content is another important determination. Search can be powerful. Without the right restrictions, it could be too powerful.</p> <p><strong><em>Process/Workflow</em></strong>. Since many business processes transcend organizational boundaries, proper transparency across departments is critical. Many transactional processes centered on structured data have already been automated by ERP systems and the like, and provide transparency to those that need it. In our experience, what are often not automated are collaborative processes that involve unstructured content (documents, designs, etc.). Think of activities like product or project management &#8211; any process currently managed by spreadsheets and email. We’ve found huge opportunities to increase speed of execution to results and reduction in errors in these scenarios. In fact, one client was able to reduce turnaround time for transportation costing by 90%, and cut approval times in half. It’s amazing what’s possible.</p> <p><strong><em>Social.</em></strong><strong><em></em></strong> Although social business has its roots in consumer social technologies, this isn’t Facebook or Pinterest. Social business is about finding the right experts quickly, fostering communities of people with like interests and skills, improving project communication and execution, and about reducing the amount of email flowing through your organization. Some argue that social is the end of cc: in email. Time will tell, but without an enterprise solution and a common platform for collaboration, organizational silos prevail and the opportunity is squandered.</p> <p><strong>How can I avoid the trap of organizational silos? </strong><br /> In our experience, collaboration across the enterprise begins with a strongly supported enterprise collaboration strategy and roadmap. Buy-in and involvement across departments is essential. This strategy must set a foundation for content taxonomy built with users and their work activities in mind, along with appropriate permission safeguards. Surfacing opportunities to accelerate collaborative business processes is critical. <a title=\"Enterprise Collaboration Strategy and Roadmap\" href=\"http://blog.tahoepartners.com/index.php/enterprise-collaboration-strategy-and-roadmap/\" target=\"_blank\">Here’s a great blog post</a> that discusses the Enterprise Collaboration Roadmap in more detail.</p> <p>The post <a href=\"http://blog.tahoepartners.com/index.php/enterprise-collaboration-obstacles-breaking-down-organizational-silos/\">Enterprise Collaboration Obstacles: Breaking Down Organizational Silos</a> appeared first on <a href=\"http://blog.tahoepartners.com\">TahoeSmart</a>.</p>"
  },
  {
    "title": "Enterprise Collaboration Strategy and Roadmap",
    "link": "http://blog.tahoepartners.com/index.php/enterprise-collaboration-strategy-and-roadmap/",
    "pubDate": "Mon, 17 Jun 2013 19:50:00 +0000",
    "creator": "David Sidwell",
    "jobTitle": "Maganing Director",
    "blurb": "An expert in SharePoint and Enterprise Collaboration strategy, Dave has delivered SharePoint business solutions ranging from dynamic websites to a program to capture and track employee ideas. Dave may have backed off his claim to run with anyone at any pace, but he is still a regular distance and event runner.",
    "creatorImage": "images/blog/daveSidwell.jpg",
    "imageLocation": "http://blog.tahoepartners.com/wp-content/uploads/2013/09/Brainstorm-Session.jpg",
    "content": "<p>Does your company have a vision, strategy and roadmap for Enterprise Collaboration? I ask our clients this question a lot, and the answer is often “do I need one?” A comprehensive strategy is a critical component of a successful and highly adopted collaboration program. There are plenty of horror stories about collaboration implementations that turned into the Wild West, or went gangbusters out the door but quickly lost the attention and use of employees, partners, suppliers and vendors. An Enterprise Collaboration Strategy puts the foundation in place to help avoid these situations.</p> <p>For us, the purpose of an Enterprise Collaboration Strategy is to establish a baseline for the current collaboration environment, identify the desired future state of the environment, and document the appropriate initiatives to move towards that desired state.</p> <p><strong>WHAT WE LOOK AT IN AN ENTERPRISE COLLABORATION STRATEGY</strong><br /> Before you know where you’re going, you have to know where you are. We look across multiple dimensions in assessing the current state and identifying the desired future state, including:</p> <ul> <li><strong>Application Usage</strong>. How are current tools used for collaboration, and how could they be used?</li> <li><strong>Communication and Change Management</strong>. How can we best communicate collaboration opportunities to drive adoption &#8211; the cornerstone of success?</li> <li><strong>Content</strong>. What types of content are created, shared, and consumed?</li> <li><strong>Development, Maintenance and Support</strong>. How are collaborative solutions developed and supported?</li> <li><strong>Governance</strong>. What people, processes, and technologies are in place to manage the set-up and growth of the collaboration environment?</li> <li><strong>Infrastructure</strong>. What infrastructure is needed to support collaboration goals?  Is the current infrastructure adequate for the desired growth?</li> <li><strong>Resources</strong>. What type of resources and skills are needed to build and support the collaboration environment?</li> <li><strong>Search</strong>. How do people find important content scattered across the organization?</li> <li><strong>Social</strong>. Can employees readily share what they are working on, and stay in tune with what others are doing?  Are subject matter experts easy to find?</li> <li><strong>Tools</strong>. What tools exist to automate the administration and governance of the collaboration environment? What is the appropriate timing for installing these tools?</li> <li><strong>Training</strong>. What do users need to know to leverage the capabilities of collaboration tools?</li> <li><strong>Usability and User Experience</strong>. How can adoption and usage be maximized by providing a user-centered experience?</li> </ul> <p><strong>HOW WE DO IT</strong><br /> First, we review current sites, tools, infrastructure, processes, and other documentation to get a solid understanding of the content, tools, and processes in use. Armed with this background, we perform individual and group interviews. While it is different for every organization, these generally cover a broad cross-section of the organization, including employees from all levels of the company. In these working sessions we hear what users are doing and what they want to do, and we share possibilities.</p> <p>In addition to internal interviews, we also leverage industry and practical best practices. These cover everything from governance, to team size and structure, to infrastructure and platform (such as SharePoint) knowledge.</p> <p><strong>WHAT WE DELIVER</strong><br /> By analyzing and assessing that information, we are able to deliver an Enterprise Collaboration Strategy, with details on:</p> <ul> <li><strong>Current state</strong>. Outlines findings on current uses of collaboration, as well as the main pain points and associated impacts.</li> <li><strong>Future state</strong>. Highlights future uses of collaboration technologies, and identifies tools and applications that may not be needed in the future due to platform consolidation.</li> <li><strong>Roadmap</strong>. Details specific activities to move from the current state to the future state. High level timeframes and budget estimates are completed for each activity and priorities are assigned.</li> </ul> <p>With an Enterprise Collaboration Strategy in place, an organization has a solid base to begin executing individual high-priority initiatives. These activities might focus on governance, increasing adoption through an intranet redesign, or creation/upgrade/stabilization of the infrastructure.</p> <p>The post <a href=\"http://blog.tahoepartners.com/index.php/enterprise-collaboration-strategy-and-roadmap/\">Enterprise Collaboration Strategy and Roadmap</a> appeared first on <a href=\"http://blog.tahoepartners.com\">TahoeSmart</a>.</p>"
  },
  {
    "title": "Enterprise Collaboration: User Experience and Change Resilient Design",
    "link": "http://blog.tahoepartners.com/index.php/enterprise-collaboration-user-experience-and-change-resilient-design/",
    "pubDate": "Wed, 09 Oct 2013 15:01:24 +0000",
    "creator": "Mike Davidson",
    "jobTitle": "Creative Director",
    "webAddress": "www.digitalbymike.com",
    "blurb": "Definitely digital. Mike’s experience in digital spans two decades. including marketing, enterprise systems, advertising, retail, mobile, and websites of all kinds. He leads teams of creatives, technologists and useer experience designers to deliver the new customer experience.",
    "creatorImage": "images/blog/mikeD.jpg",
    "imageLocation": "http://blog.tahoepartners.com/wp-content/uploads/2013/10/Change.jpg",
    "content": "<p>When we begin to talk about enterprise collaboration, almost every company quickly mentions their challenges with usability and adoption. It’s a common theme because most technology environments grow organically as needs arise, and user experience falls victim to technology transition and business evolution. As we approach a redesign and begin creating an <a title=\"Enterprise Collaboration Strategy and Roadmap\" href=\"http://blog.tahoepartners.com/index.php/enterprise-collaboration-strategy-and-roadmap/\" target=\"_blank\">Enterprise Collaboration roadmap</a>, we look closely at the current and future challenges of organizational change, and building a ‘change resilient’ design.</p> <p><b>Factors of Organization Change</b></p> <p><a href=\"http://blog.tahoepartners.com/wp-content/uploads/2013/10/GFX-Organization-Change-Factors.png\"><img class=\"alignnone size-full wp-image-1396\" alt=\"Organization-Change-Factors\" src=\"http://blog.tahoepartners.com/wp-content/uploads/2013/10/GFX-Organization-Change-Factors.png\" width=\"942\" height=\"245\" /></a></p> <p>&nbsp;</p> <p><b>A Change Resilient Design</b><br /> A top redesign objective is creating a stable Information Architecture that evolves in an elegant manner, anticipates scale, and is resilient to flux. It begins with a shift in design philosophy: we design navigation for people not companies. Contemporary navigation presents categories by <i>user intention</i> versus <i>organizational silo</i>.</p> <p>Companies often design top-level navigation based on organizational structure – departments, business units, or org charts. This makes the content architecture highly susceptible to change. As a solution, we rethink navigation from the employee’s perspective, tailoring the experience to the individual and to their unique role, supporting how they work. This task-based design results in a more stable content architecture, and an experience that is better suited to performing specific tasks. Navigation can never be all things to all people, but we can tailor views and provide personalization that better meets each user’s unique needs.</p> <p>In planning a roadmap, we consider the various roles, jobs, and departments within your company. The breadth and depth of understanding your enterprise users is a significant factor in scoping budget and timelines. This activity is commonly referred to as <i>User Definition</i>, and it is the foundation for the design process and a key element of improving adoption and productivity. We ask questions like:</p> <ul> <li>How many user types exist within your company?</li> <li>Which are primary versus secondary user groups? (Value to business)</li> <li>What are their working conditions, unique tasks, and content interactions?</li> </ul> <p>Understanding these and other insights will result in a more intelligent design and improved usability. This information can be gathered through interviews and observation; the rigor of this process varies and is a scope consideration. One option is to view the process as iterative, defining users with initial broad strokes and refining the details over time – improving efficiency, adding functionality and tailoring experiences.</p> <p>A tenet of great web design is to view your Intranet as a living, breathing entity. There is no end to the project, only phases and new releases. Build your <a title=\"Enterprise Collaboration Strategy and Roadmap\" href=\"http://blog.tahoepartners.com/index.php/enterprise-collaboration-strategy-and-roadmap/\" target=\"_blank\">Enterprise Collaboration roadmap</a> with this philosophy in mind, and you will always be adding value, improving performance and gaining adoption.</p> <p>The post <a href=\"http://blog.tahoepartners.com/index.php/enterprise-collaboration-user-experience-and-change-resilient-design/\">Enterprise Collaboration: User Experience and Change Resilient Design</a> appeared first on <a href=\"http://blog.tahoepartners.com\">TahoeSmart</a>.</p>"
  }
]